OpenROAD v2.0-18442-g19e09eea1 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
read_libraries
[INFO ODB-0227] LEF file: sky130_fd_sc_hd.tlef, created 13 layers, 25 vias
[INFO ODB-0227] LEF file: sky130_fd_sc_hd_merged.lef, created 441 library cells
read_verilog $synth_verilog
link_design $top_module
read_sdc $sdc_file
set_thread_count [exec getconf _NPROCESSORS_ONLN]
# Temporarily disable sta's threading due to random failures
sta::set_thread_count 1
utl::metric "IFP::ord_version" [ord::openroad_git_describe]
# Note that sta::network_instance_count is not valid after tapcells are added.
utl::metric "IFP::instance_count" [sta::network_instance_count]
initialize_floorplan -site $site \
  -die_area $die_area \
  -core_area $core_area
[INFO IFP-0001] Added 21 rows of 125 site unithd.
source $tracks_file
# remove buffers inserted by synthesis 
remove_buffers
[INFO RSZ-0026] Removed 0 buffers.
################################################################
# IO Placement (random)
place_pins -random -hor_layers $io_placer_hor_layer -ver_layers $io_placer_ver_layer
Found 0 macro blocks.
Using 2 tracks default min distance between IO pins.
[INFO PPL-0007] Random pin placement.
################################################################
# Macro Placement
if { [have_macros] } {
  global_placement -density $global_place_density
  macro_placement -halo $macro_place_halo -channel $macro_place_channel
}
################################################################
# Tapcell insertion
eval tapcell $tapcell_args
[INFO TAP-0005] Inserted 46 tapcells.
write_def alu_post_tapcell.def
